# LoadCaseNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadCaseNumber Property
ParameterTypeId Class See Also
---
"Case Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadCaseNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadCaseNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadCaseNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace